{"id": "9f4d8e4e-5bcd-4a74-8d38-8d5c6d84c5c1", "name": "SIGMA - Suspicious PowerShell EncodedCommand", "enabled": true, "throttle": "no_actions", "interval": "5m", "author": ["12ban"], "description": "Detects PowerShell usage with Base64 encoded commands", "rule_id": "9f4d8e4e-5bcd-4a74-8d38-8d5c6d84c5c1", "false_positives": ["legitimate administration scripts"], "from": "now-5m", "immutable": false, "license": "DRL", "output_index": "", "meta": {"from": "1m"}, "max_signals": 100, "risk_score": 47, "risk_score_mapping": [], "severity": "medium", "severity_mapping": [], "threat": [], "tags": ["attack-t1059.001"], "to": "now", "references": [], "version": 1, "exceptions_list": [], "related_integrations": [], "required_fields": [], "setup": "", "type": "query", "language": "lucene", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "process.executable:*\\\\powershell.exe AND process.command_line:*EncodedCommand*", "filters": [], "actions": []}
